DataProcessors/НастройкаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкаДействий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/НастройкаДействий/Forms/Форма/Ext/Form/Module.bsl
Процедура СохранитьНаСервере()
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	ЗаписатьЗначения("ТаблицаКнопокПКД", 		"ПКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокРКД", 		"РКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокСостояния", 	"Сост_", 	ПустойПользователь);
	
КонецПроцедуры 

Процедура ЗаписатьЗначения(НаименованиеТаблицы, ТипТаблицы, ПустойПользователь)

	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого СтрокаТаблицы Из ТЗ Цикл
		Если НЕ СтрокаТаблицы.Изменена Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаТаблицы.Изменена = Ложь;
		
		ИмяНастройки 	= "СчетчикиКнопки_" + ТипТаблицы + СтрокаТаблицы.Наименование;
		
		Для х = 1 По ТЗ.Колонки.Количество() - 1 Цикл
			
			МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
			МенеджерЗаписи.НомерНастройки 	= х - 1;
			МенеджерЗаписи.Значение			= СтрокаТаблицы[ТЗ.Колонки.Получить(х).Имя];
			МенеджерЗаписи.Записать(); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

Процедура ЗаполнитьНаименование()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	СоздатьКолонки("ТаблицаКнопокПКД", 			омЗадачиОбщие.КолонкиТаблицаКнопокПКД(), 		ТипБулево);
	СоздатьКолонки("ТаблицаКнопокРКД", 			омЗадачиОбщие.КолонкиТаблицаКнопокРКД(), 		ТипБулево);
	СоздатьКолонки("ТаблицаКнопокСостояния", 	омЗадачиОбщие.КолонкиТаблицаКнопокСостояние(), 	ТипБулево);
	
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеПКД(), 		"ПКД_",  "ТаблицаКнопокПКД");
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеРКД(), 		"РКД_",  "ТаблицаКнопокРКД");
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеСостояний(), "Сост_", "ТаблицаКнопокСостояния");
                                                                                                                    
КонецПроцедуры // ПолучитьТаблицу()

Процедура СоздатьКолонки(ТаблицаФормы, ИменаКолонок, ТипБулево)

	Реквизиты = Новый Массив; 
	
	Для Каждого ИмяКолонки ИЗ ИменаКолонок Цикл
		Реквизиты.Добавить(Новый РеквизитФормы(СтрЗаменить(ИмяКолонки, " ", "_"), ТипБулево, ТаблицаФормы));
	КонецЦикла;
	
	ИзменитьРеквизиты(Реквизиты);
	
	Для Каждого ИмяКолонки ИЗ ИменаКолонок Цикл
		
		ДанныеКолонки = СтрЗаменить(ИмяКолонки, " ", "_");
		
		Рек = Элементы.Добавить(ТаблицаФормы + ДанныеКолонки, Тип("ПолеФормы"), Элементы[ТаблицаФормы]);
		Рек.Вид = ВидПоляФормы.ПолеФлажка;
		Рек.ПутьКДанным = ТаблицаФормы + "." + ДанныеКолонки;
		Рек.Заголовок = ИмяКолонки;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьТаблицу(НаименованиеКнопок, ТипТаблицы, НаименованиеТаблицы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&НаименованиеДанных)
		|	И НастройкиПроекта.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("НаименованиеДанных", НаименованиеКнопок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого х Из НаименованиеКнопок Цикл
		
		НС = ТЗ.Добавить();
		НС.Наименование = СтрЗаменить(х, "СчетчикиКнопки_" + ТипТаблицы, "");
		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл 
		
		Наименование = СтрЗаменить(Выборка.ИмяНастройки, "СчетчикиКнопки_" + ТипТаблицы, "");
		
		НайденаяСтрока = ТЗ.Найти(Наименование, "Наименование");
		
		НайденаяСтрока[ТЗ.Колонки.Получить(Выборка.НомерНастройки + 1).Имя] = Истина;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокПКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокРКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокРКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокСостояния.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаКнопокРКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокРКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаименование();
КонецПроцедуры
